Final/Subsonic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    back
    {
        type            empty;
        physicalType    empty;
        nFaces          4455;
        startFace       8667;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          36;
        startFace       13122;
    }
    front
    {
        type            empty;
        physicalType    empty;
        nFaces          4455;
        startFace       13158;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          90;
        startFace       17613;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          36;
        startFace       17703;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          90;
        startFace       17739;
    }
    wall
    {
        type            wall;
        physicalType    patch;
        nFaces          234;
        startFace       17829;
    }
)

// ************************************************************************* //
